1 How to import pandas and check the version?

In [1]:
import numpy as np  
import pandas as pd
print(pd.__version__)
print(pd.show_versions(as_json=True))

1.4.3
{
  "system": {
    "commit": "e8093ba372f9adfe79439d90fe74b0b5b6dea9d6",
    "python": "3.9.13.final.0",
    "python-bits": 64,
    "OS": "Windows",
    "OS-release": "10",
    "Version": "10.0.19044",
    "machine": "AMD64",
    "processor": "Intel64 Family 6 Model 23 Stepping 10, GenuineIntel",
    "byteorder": "little",
    "LC_ALL": null,
    "LANG": null,
    "LOCALE": {
      "language-code": "English_India",
      "encoding": "1252"
    }
  },
  "dependencies": {
    "pandas": "1.4.3",
    "numpy": "1.23.1",
    "pytz": "2022.1",
    "dateutil": "2.8.2",
    "setuptools": "58.1.0",
    "pip": "22.2.2",
    "Cython": null,
    "pytest": null,
    "hypothesis": null,
    "sphinx": null,
    "blosc": null,
    "feather": null,
    "xlsxwriter": null,
    "lxml.etree": null,
    "html5lib": null,
    "pymysql": null,
    "psycopg2": null,
    "jinja2": "3.1.2",
    "IPython": "8.4.0",
    "pandas_datareader": null,
    "bs4": "4.11.1",
    "bottleneck": null,
    "brotli": null,
    "fastparquet": null,
    "fsspec": null,
    "gcsfs": null,
    "markupsafe": "2.1.1",
    "matplotlib": "3.5.2",
    "numba": null,
    "numexpr": null,
    "odfpy": null,
    "openpyxl": "3.0.10",
    "pandas_gbq": null,
    "pyarrow": null,
    "pyreadstat": null,
    "pyxlsb": null,
    "s3fs": null,
    "scipy": "1.8.1",
    "snappy": null,
    "sqlalchemy": null,
    "tables": null,
    "tabulate": null,
    "xarray": null,
    "xlrd": null,
    "xlwt": null,
    "zstandard": null
  }
}None

2 How to create a series from a list, numpy array and dict?

In [2]:
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))


ser1 = pd.Series(mylist)
ser2 = pd.Series(myarr)
ser3 = pd.Series(mydict)
print(ser3.head())

a    0
b    1
c    2
e    3
d    4
dtype: int32

3 How to convert the index of a series into a column of a dataframe?

In [3]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)

df = ser.to_frame().reset_index()
print(df.head())

  index  0
0     a  0
1     b  1
2     c  2
3     e  3
4     d  4

4 How to combine many series to form a dataframe?

In [4]:

import numpy as np
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))


df = pd.concat([ser1, ser2], axis=1)

print(df.head())

   0  1
0  a  0
1  b  1
2  c  2
3  e  3
4  d  4

5 How to assign name to the series’ index?

In [5]:
ser = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))


ser.name = 'alphabets'
ser.head()

0    a
1    b
2    c
3    e
4    d
Name: alphabets, dtype: object

6 How to get the items of series A not present in series B?

In [6]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])


ser1[~ser1.isin(ser2)]

0    1
1    2
2    3
dtype: int64

7 How to get the items not common to both series A and series B?

In [7]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])


union = pd.Series(np.union1d(ser1, ser2)) 
intersection = pd.Series(np.intersect1d(ser1, ser2))  
union[~union.isin(intersection)]

0    1
1    2
2    3
5    6
6    7
7    8
dtype: int64

8 How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?

In [8]:

state = np.random.RandomState(100)
ser = pd.Series(state.normal(10, 5, 25))


np.percentile(ser, q=[0, 25, 50, 75, 100])

array([ 1.25117263,  7.70986507, 10.92259345, 13.36360403, 18.0949083 ])

9 How to get frequency counts of unique items of a series?

In [9]:

ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))


ser.value_counts()

e    8
f    7
d    5
b    4
h    3
c    2
g    1
dtype: int64

10 How to keep only top 2 most frequent values as it is and replace everything else as ‘Other’?

In [113]:
np.random.RandomState(100)
ser = pd.Series(np.random.randint(1, 5, [12]))


print("Top 2 Freq:", ser.value_counts())
ser[~ser.isin(ser.value_counts().index[:2])] = 'Other'
ser

Top 2 Freq: 1    4
2    3
3    3
4    2
dtype: int64

0         1
1         2
2     Other
3     Other
4         2
      ...
7     Other
8         1
9     Other
10        1
11    Other
Length: 12, dtype: object

11 How to bin a numeric series to 10 groups of equal size?

In [11]:
ser = pd.Series(np.random.random(20))
print(ser.head())


pd.qcut(ser, q=[0, .10, .20, .3, .4, .5, .6, .7, .8, .9, 1], 
        labels=['1st', '2nd', '3rd', '4th', '5th', '6th', '7th', '8th', '9th', '10th']).head()

0    0.975373
1    0.246930
2    0.155861
3    0.094871
4    0.141039
dtype: float64

0    10th
1     4th
2     2nd
3     1st
4     2nd
dtype: category
Categories (10, object): ['1st' < '2nd' < '3rd' < '4th' ... '7th' < '8th' < '9th' < '10th']

12 How to convert a numpy array to a dataframe of given shape? (L1)

In [12]:

ser = pd.Series(np.random.randint(1, 10, 35))


df = pd.DataFrame(ser.values.reshape(7,5))
print(df)

   0  1  2  3  4
0  7  4  2  7  1
1  2  1  5  3  6
2  9  2  9  5  3
3  2  4  4  3  3
4  3  4  4  7  6
5  2  9  9  9  1
6  8  1  9  7  9

13 How to find the positions of numbers that are multiples of 3 from a series?

In [13]:

ser = pd.Series(np.random.randint(1, 10, 7))
ser

print(ser)

print("Multiples of 3 In The Series Are :")
for i in ser:
    if i%3 == 0:
        print(i)

0    8
1    6
2    3
3    2
4    4
5    1
6    6
dtype: int32
Multiples of 3 In The Series Are :
6
3
6

14. How to extract items at given positions from a series

In [14]:
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]

ser.take(pos)

0     a
4     e
8     i
14    o
20    u
dtype: object

15. How to stack two series vertically and horizontally ?

In [15]:
ser1 = pd.Series(range(5))
ser2 = pd.Series(list('abcde'))

In [16]:
#Vertically

ser1.append(ser2)

C:\Users\Msc 1\AppData\Local\Temp\ipykernel_5808\3317223685.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ser1.append(ser2)

0    0
1    1
2    2
3    3
4    4
0    a
1    b
2    c
3    d
4    e
dtype: object

In [17]:
#Horizontally ( axis = 1)
pd.concat([ser1,ser2], axis = 1)

   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

16. How to get the positions of items of series A in another series B?

In [18]:
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

In [19]:
sol = [pd.Index(ser1).get_loc(i) for i in ser2] 

sol

[5, 4, 0, 8]

17 How to compute the mean squared error on a truth and predicted series?

In [20]:
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)

In [21]:
mse = 0

mse = (pred-truth)**2
    
mse

np.mean(mse)

0.3178119727887908

18 How to convert the first character of each element in a series to uppercase?

In [22]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])

In [23]:
ser.str.title()

0     How
1      To
2    Kick
3    Ass?
dtype: object

19 How to calculate the number of characters in each word in a series?

In [24]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])

In [25]:
for i in ser:
    print(f"{i} : {len(i)}")

how : 3
to : 2
kick : 4
ass? : 4

20 How to compute difference of differences between consequtive numbers of a series?

In [26]:
ser = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

In [27]:
d1 = ser.diff()
d2 = d1.diff()
print("Differences : ",d1.tolist())
print("Difference of Differences : ",d2.tolist())

Differences :  [nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]
Difference of Differences :  [nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]

21 How to convert a series of date-strings to a timeseries?

In [28]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20:09'])

In [29]:
pd.to_datetime(ser)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:09
dtype: datetime64[ns]

22 How to get the day of month, week number, day of year and day of week from a series of date strings?

In [117]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])

In [119]:
from dateutil.parser import parse
ser_ts = ser.map(lambda x: parse(x))
print("Date: ", ser_ts.dt.day.tolist())
print("Week: ", ser_ts.dt.weekofyear.tolist())
print("Day number: ", ser_ts.dt.dayofyear.tolist())

Date:  [1, 2, 3, 4, 5, 6]
Week:  [53, 5, 9, 14, 19, 23]
Day number:  [1, 33, 63, 94, 125, 157]

C:\Users\Msc 1\AppData\Local\Temp\ipykernel_5808\2548968965.py:4: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  print("Week: ", ser_ts.dt.weekofyear.tolist())

23. How to convert year-month string to dates corresponding to the 4th day of the month?

In [33]:
ser = pd.Series(['Jan 2010', 'Feb 2011', 'Mar 2012'])
ser.map(lambda x: parse('04 ' + x))

0   2010-01-04
1   2011-02-04
2   2012-03-04
dtype: datetime64[ns]

24. How to filter words that contain atleast 2 vowels from a series?

In [34]:
ser = pd.Series(['Apple', 'Orange', 'Plan', 'Python', 'Money'])

from collections import Counter
mask = ser.map(lambda x: sum([Counter(x.lower()).get(i, 0) for i in list('aeiou')]) >= 2)
ser[mask]

0     Apple
1    Orange
4     Money
dtype: object

26. How to get the mean of a series grouped by another series?

In [36]:
fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
weights = pd.Series(np.linspace(1, 10, 10))
print(weights.tolist())
print(fruit.tolist())

[1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0]
['banana', 'banana', 'banana', 'banana', 'carrot', 'banana', 'banana', 'banana', 'apple', 'banana']

In [37]:
weights.groupby(fruit).mean()

apple     9.000
banana    5.125
carrot    5.000
dtype: float64

27. How to compute the euclidean distance between two series?

In [38]:
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])

In [39]:
np.linalg.norm(p-q)

18.16590212458495

29. How to replace missing spaces in a string with the least frequent character?

In [41]:
my_str = 'dbc deb abed gade'

In [42]:
ser = pd.Series(list('dbc deb abed gade'))
freq = ser.value_counts()
print(freq)
least_freq = freq.dropna().index[-1]
"".join(ser.replace(' ', least_freq))

d    4
b    3
     3
e    3
a    2
c    1
g    1
dtype: int64

'dbcgdebgabedggade'

30. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays) after that having random numbers as values?

In [43]:
ser = pd.Series(np.random.randint(1,10,10), pd.date_range('2000-01-01', periods=10, freq='W-SAT'))
ser

2000-01-01    6
2000-01-08    9
2000-01-15    5
2000-01-22    9
2000-01-29    9
2000-02-05    3
2000-02-12    2
2000-02-19    1
2000-02-26    2
2000-03-04    4
Freq: W-SAT, dtype: int32

31. How to fill an intermittent time series so all missing dates show up with values of previous non-missing date?

In [44]:
ser = pd.Series([1,10,3,np.nan], index=pd.to_datetime(['2000-01-01', '2000-01-03', '2000-01-06', '2000-01-08']))
print(ser)

2000-01-01     1.0
2000-01-03    10.0
2000-01-06     3.0
2000-01-08     NaN
dtype: float64

In [46]:
ser.resample('D').ffill()
# This will fill with previous value

2000-01-01     1.0
2000-01-02     1.0
2000-01-03    10.0
2000-01-04    10.0
2000-01-05    10.0
2000-01-06     3.0
2000-01-07     3.0
2000-01-08     NaN
Freq: D, dtype: float64

36. How to import only specified columns from a csv file?

df = pd.read_csv('train.csv', usecols=['meal_id', 'num_orders'])
print(df.head())

39. How to rename a specific columns in a dataframe?

In [52]:
df = pd.read_csv('train.csv', usecols=['meal_id', 'num_orders'])
print(df.columns)

Index(['meal_id', 'num_orders'], dtype='object')

In [53]:
df.columns = df.columns.map(lambda x: x.replace('_', '-'))
print(df.columns)

Index(['meal-id', 'num-orders'], dtype='object')

40. How to check if a dataframe has any missing values?

In [55]:
df.isnull().values.any()

False

41. How to count the number of missing values in each column?

In [56]:
missing = df.apply(lambda x: x.isnull().sum())
missing.argmax()

0

44. How to select a specific column from a dataframe as a dataframe instead of a series?

In [57]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))

In [58]:
type(df[['a']])
type(df.loc[:, ['a']])
type(df.iloc[:, [0]])

pandas.core.frame.DataFrame

45. How to change the order of columns of a dataframe?

In [60]:
df

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [59]:
df[list('cbade')]

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

46. How to set the number of rows and columns displayed in the output?

In [62]:
df = pd.read_csv('train.csv', usecols=['meal_id', 'num_orders'])
df

        meal_id  num_orders
0          1885         177
1          1993         270
2          2539         189
3          2139          54
4          2631          40
...         ...         ...
456543     1543          68
456544     2304          42
456545     2664         501
456546     2569         729
456547     2490         162

[456548 rows x 2 columns]

In [66]:
pd.set_option('display.max_columns', 10)
pd.set_option('display.max_rows', 10)

47. How to format or suppress scientific notations in a pandas dataframe?

In [68]:
df = pd.DataFrame(np.random.random(4)**10, columns=['random'])
df

         random
0  3.135291e-07
1  1.738742e-01
2  1.457343e-03
3  8.268758e-13

In [69]:
df.round(4)

   random
0  0.0000
1  0.1739
2  0.0015
3  0.0000

48. How to format all the values in a dataframe as percentages?

In [70]:
df = pd.DataFrame(np.random.random(4), columns=['random'])
df

     random
0  0.748852
1  0.264672
2  0.842158
3  0.847972

In [71]:
out = df.style.format({
    'random': '{0:.2%}'.format,
})

out

51. How to get the row number of the nth largest value in a column?

In [73]:
df = pd.DataFrame(np.random.randint(1, 30, 30).reshape(10,-1), columns=list('abc'))

n = 8
df['a'].argsort()[::-1][n]

1

53. How to get the last n rows of a dataframe with row sum > 100?

In [86]:
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))
rowsums = df.apply(np.sum, axis=1)
last_three_rows = df.iloc[np.where(rowsums > 100)[0][-3:], :]

In [87]:
last_three_rows

     0   1   2   3
11  28  23  24  39
12  23  32  38  33
13  22  36  32  29

56. How to swap two rows of a dataframe?

In [90]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))

print(df)
print("\n**************AFTER SWAP ***************\n")

def swap_rows(df, i1, i2):
    a, b = df.iloc[i1, :].copy(), df.iloc[i2, :].copy()
    df.iloc[i1, :], df.iloc[i2, :] = b, a
    return df

print(swap_rows(df, 1, 2))

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24

**************AFTER SWAP ***************

    0   1   2   3   4
0   0   1   2   3   4
1  10  11  12  13  14
2   5   6   7   8   9
3  15  16  17  18  19
4  20  21  22  23  24

57. How to reverse the rows of a dataframe?

In [91]:
df = pd.DataFrame(np.arange(25).reshape(5, -1))

df.iloc[::-1, :]

    0   1   2   3   4
4  20  21  22  23  24
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

59. Which column contains the highest number of row-wise maximum values?

In [93]:
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1))

print('Column with highest row max values are : ', df.apply(np.argmax, axis=1).value_counts().index[0])

Column with highest row max values are :  1

62. How to create a column containing the minimum by maximum of each row?

In [96]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))

minMAX = df.apply(lambda x: np.min(x)/np.max(x), axis=1)

minMAX

0    0.171429
1    0.081395
2    0.042553
3    0.011111
4    0.027397
5    0.045455
6    0.180851
7    0.084337
dtype: float64

68. How to get the n’th largest value of a column when grouped by another column?

In [97]:
df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                   'taste': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})

print(df)

df_grpd = df['taste'].groupby(df.fruit)
df_grpd.get_group('banana').sort_values().iloc[-2]

    fruit     taste  price
0   apple  0.184870      8
1  banana  0.576841      6
2  orange  0.776722      7
3   apple  0.700408      0
4  banana  0.162067      1
5  orange  0.875939     11
6   apple  0.103245     11
7  banana  0.479826      6
8  orange  0.704916     12

0.479826368185037

69. How to compute grouped mean on pandas dataframe and keep the grouped column as another column (not index)?

In [98]:
df = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                   'rating': np.random.rand(9),
                   'price': np.random.randint(0, 15, 9)})

In [100]:
output = df.groupby('fruit', as_index=False)['price'].mean()
print(output)

    fruit     price
0   apple  7.666667
1  banana  9.000000
2  orange  4.333333

70. How to join two dataframes by 2 columns so they have only the common rows?

In [101]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})

In [103]:
pd.merge(df1, df2, how='inner', left_on=['fruit', 'weight'], right_on=['pazham', 'kilo'], suffixes=['_left', '_right'])

    fruit weight  price_left  pazham  kilo  price_right
0   apple   high          14   apple  high            0
1   apple   high           1   apple  high            0
2   apple   high          11   apple  high            0
3  orange    low           0  orange   low            3
4  orange    low           2  orange   low            3
5  orange    low           7  orange   low            3

71. How to remove rows from a dataframe that are present in another dataframe?

In [104]:
print(df1[~df1.isin(df2).all(1)])

    fruit  weight  price
0   apple    high     14
1  banana  medium     10
2  orange     low      0
3   apple    high      1
4  banana  medium      2
5  orange     low      2
6   apple    high     11
7  banana  medium      2
8  orange     low      7

72. How to get the positions where values of two columns match?

In [111]:
df = pd.DataFrame({'fruit1': np.random.choice(['apple', 'orange', 'banana'], 10),
                    'fruit2': np.random.choice(['apple', 'orange', 'banana'], 10)})

np.where(df.fruit1 == df.fruit2)

(array([1, 2, 3, 5, 8], dtype=int64),)

74. How to get the frequency of unique values in the entire dataframe?

In [112]:
df = pd.DataFrame(np.random.randint(1, 10, 20).reshape(-1, 4), columns = list('abcd'))

pd.value_counts(df.values.ravel())

3    4
5    3
8    3
9    3
1    2
7    2
2    1
4    1
6    1
dtype: int64

# *****************END*********************